In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
## %%sql sqlite + driver//username and password/database name

In [7]:
%%sql sqlite:///fool.db
CREATE TABLE writer (first_name, last_name, year_of_death);

Done.

[]

In [8]:
%%sql
INSERT INTO writer VALUES ("William", "Shakespeare", 1616);
INSERT INTO writer VALUES ("Bertold", "brecht", 1956);
INSERT INTO writer VALUES ("Wes", "Mckinney", Null);

 * sqlite:///fool.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql
select * from writer

 * sqlite:///fool.db
Done.

[('William', 'Shakespeare', 1616),
 ('Bertold', 'brecht', 1956),
 ('Wes', 'Mckinney', None)]

In [10]:
%%sql
select first_name as Name, last_name as Surname from writer;

 * sqlite:///fool.db
Done.

[('William', 'Shakespeare'), ('Bertold', 'brecht'), ('Wes', 'Mckinney')]

In [12]:
%%sql
select count(first_name) from writer where year_of_death between 1950 and 2000;

 * sqlite:///fool.db
Done.

[(1,)]

In [15]:
result = %sql select * from writer where year_of_death between 1600 and 2000;

 * sqlite:///fool.db
Done.

In [16]:
type(result)

sql.run.ResultSet

In [17]:
dataframe = result.DataFrame()

In [18]:
type(dataframe)

pandas.core.frame.DataFrame

In [19]:
%%sql
select * from writer

 * sqlite:///fool.db
Done.

[('William', 'Shakespeare', 1616),
 ('Bertold', 'brecht', 1956),
 ('Wes', 'Mckinney', None)]

In [20]:
dataframe

  first_name    last_name  year_of_death
0    William  Shakespeare           1616
1    Bertold       brecht           1956

In [37]:
%%sql  
update writer SET year_of_death = 2020 where first_name="William";

 * sqlite:///fool.db
1 rows affected.

[]

In [41]:
%%sql
select * from writer

 * sqlite:///fool.db
Done.

[('William', 'Shakespeare', 2020), ('Bertold', 'brecht', 1956)]

In [40]:
%%sql
delete  from writer where first_name="Wes"

 * sqlite:///fool.db
1 rows affected.

[]